Gggt124/fish-env-control-system/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x10000

# Development workflow: plain idf.py flash. Re-enable encryption only for production hardening.
# CONFIG_SECURE_FLASH_ENC_ENABLED is not set
# CONFIG_NVS_ENCRYPTION is not set

# Bootloader defaults
CONFIG_BOOTLOADER_COMPILE_TIME_DATE=n
CONFIG_BOOTLOADER_LOG_LEVEL_ERROR=y

# Flash size: actual hardware is 4MB
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Disable ESP-IDF auto TWDT init (we init it ourselves in app_main with 10s timeout + panic)
# CONFIG_ESP_TASK_WDT_INIT is not set
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y

# HTTP server plus captive DNS need socket headroom during browser refreshes.
CONFIG_LWIP_MAX_SOCKETS=16

# Runtime stats disabled for production: causes CPU overhead on every context switch.
# Re-enable temporarily during soak diagnostics only.
# CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS is not set
# CONFIG_FREERTOS_RUN_TIME_STATS_USING_ESP_TIMER is not set

# Stack overflow detection: method 2 (stack pointer canary check) panics on overflow instead of silently corrupting memory.
CONFIG_FREERTOS_CHECK_STACKOVERFLOW=2

# Task list formatting for debugging
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y

# Coredump configuration for crash analysis
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y

# Brownout detector: raise threshold to level 6 (~2.80V) to force clean reset
# before relay-induced voltage sag causes logic instability.
# Level 6 chosen over level 7 (~2.97V) to avoid false resets on USB dev boards.
CONFIG_ESP_BROWNOUT_DET=y
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_6=y
